In [1]:
# Q1
import pandas as pd

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [5]:
print(obj1)
print(obj2)
print(obj3)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [6]:
import math
math.isnan(obj2['California'])

True

In [7]:
obj2['California'] == None

False

In [9]:
x = obj2['California']
obj2['California'] != x

True

In [12]:
math.nan == math.nan

False

In [13]:
# Q2
import pandas as pd
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)

In [14]:
print(S)

1    Alice
2      Bob
3     Rita
4    Molly
5     Ryan
dtype: object

In [18]:
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

In [24]:
# Q3

df = pd.DataFrame([{'Name': 'Alice',
              'Class': 'Physics',
              'Score': 85},
            {'Name': 'Jack',
             'Class': 'Chemistry',
             'Score': 82},
            {'Name': 'Helen',
             'Class': 'Biology',
             'Score': 90}])

In [28]:
df = df.rename(mapper = lambda x: x.upper(), axis = 'columns')
df

    NAME      CLASS  SCORE
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90

In [31]:
df = df.rename(mapper = lambda x: x.lower(), axis = 1)
df

    name      class  score
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90

In [32]:
df.rename(mapper = lambda x: x.upper(), axis = 1)
df

    name      class  score
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90

In [33]:
df.rename(mapper = lambda x: x.upper(), axis = 1, inplace=True)
df

    NAME      CLASS  SCORE
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90

In [25]:
# I can create empty dataframe
dft = pd.DataFrame()

In [37]:
# Q4
sc = [{'Serial No.': 1, 'gre score': 337, 'toefl score': 118},
      {'Serial No.': 2, 'gre score': 324, 'toefl score': 107},
      {'Serial No.': 3, 'gre score': 316, 'toefl score': 104},
      {'Serial No.': 4, 'gre score': 322, 'toefl score': 110},
      {'Serial No.': 5, 'gre score': 314, 'toefl score': 103}
     ]
df = pd.DataFrame(sc)
df = df.set_index('Serial No.')
df

            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [43]:
df1 = df[df['toefl score']>105]
print(df1)
print(df)

            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
4                 322          110
            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [44]:
df2=df.where(df['toefl score']>105)
print(df2)
print(df)

            gre score  toefl score
Serial No.
1               337.0        118.0
2               324.0        107.0
3                 NaN          NaN
4               322.0        110.0
5                 NaN          NaN
            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [45]:
df.where(df['toefl score']>105).dropna()
print(df)

            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [46]:
df3=df.where(df['toefl score']>105).dropna()
print(df3)

            gre score  toefl score
Serial No.
1               337.0        118.0
2               324.0        107.0
4               322.0        110.0

In [50]:
df[df['toefl score']>105]

            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
4                 322          110

In [60]:
# Q5
sr = pd.Series(['a','b','c'])
print(sr)
import numpy as np
a2d = np.array([[1,2],[3,4]])
print(a2d, a2d.shape, a2d.ndim)
df_1 = pd.DataFrame(sr)
df_2 = pd.DataFrame(a2d)
print(df_1)
print(df_2)

0    a
1    b
2    c
dtype: object
[[1 2]
 [3 4]] (2, 2) 2
   0
0  a
1  b
2  c
   0  1
0  1  2
1  3  4

In [71]:
# Q6
n = np.arange(0,16).reshape(4,4)
df = pd.DataFrame(n, index=['Ohio','Colorado','Utah','New York'])
df.rename(columns = {0:'one', 1:'two', 2:'three', 3:'four'}, inplace=True)
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [72]:
df.drop(['Utah','Colorado'])

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

In [74]:
df.drop('Ohio')

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [75]:
df.drop('one',axis=1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [92]:
# Q7
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [93]:
# s2.loc[1] ERROR
s2[1]
s1.loc[1]
s2.iloc[1]

2

In [85]:
# Q8
s3=s2.append(s1)
print(s3)
print(s2)

Alice        1
Jack         2
Molly        3
1        Alice
2         Jack
3        Molly
dtype: object
Alice    1
Jack     2
Molly    3
dtype: int64

In [87]:
for label, value in s3.iteritems():
    print(label, value)

Alice 1
Jack 2
Molly 3
1 Alice
2 Jack
3 Molly

In [94]:
s4=pd.Series(["Tim","David","Chris"],index=[0,0,0])

In [96]:
s5=s1.append(s4)
s5

1    Alice
2     Jack
3    Molly
0      Tim
0    David
0    Chris
dtype: object

In [98]:
s5.loc[0]

0      Tim
0    David
0    Chris
dtype: object

In [104]:
# Q9
sc = [{'Serial No.': 1, 'gre score': 337, 'toefl score': 118},
      {'Serial No.': 2, 'gre score': 324, 'toefl score': 107},
      {'Serial No.': 3, 'gre score': 316, 'toefl score': 104},
      {'Serial No.': 4, 'gre score': 322, 'toefl score': 110},
      {'Serial No.': 5, 'gre score': 314, 'toefl score': 103}
     ]
df = pd.DataFrame(sc)
df = df.set_index('Serial No.')
df[(df['toefl score']>105) & (df['toefl score']<115)]
df[df['toefl score'].gt(105) & df['toefl score'].lt(115)]
df[(df['toefl score'].isin(range(106,115)))]
(df['toefl score']>105 & (df['toefl score']<115))  #is a mask

Serial No.
1    True
2    True
3    True
4    True
5    True
Name: toefl score, dtype: bool

In [123]:
# Q10
df=pd.DataFrame([{'Major':'Mathematics','Name':'Alice','Age':20,'Gender':'F'},
                 {'Major':'Siciology','Name':'Jack','Age':22,'Gender':'M'}])
df=df.set_index('Major')
df

              Name  Age Gender
Major
Mathematics  Alice   20      F
Siciology     Jack   22      M

In [125]:
df.loc['Mathematics']

Name      Alice
Age          20
Gender        F
Name: Mathematics, dtype: object

In [126]:
df.T

Major  Mathematics Siciology
Name         Alice      Jack
Age             20        22
Gender           F         M

In [127]:
df.T['Mathematics']

Name      Alice
Age          20
Gender        F
Name: Mathematics, dtype: object